hired/app/models/user.rb

SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", ""], ["LIMIT", 1]]
---
  def self.find_by_credentials( uname, pass )
    user = User.find_by( username: uname )