hired/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def current_user
    id = Session.get_user_id_by_token( session[:session_token] )
    User.find(id) unless id.nil?